'''
## -------------------------------------------------------------------
## クリップボードアイテムのコンテンツ文字列を加工するためのテンプレート
## 以下の関数を実装することで、クリップボードアイテムのコンテンツ文字列を加工することができる
## 戻り値は文字列である必要がある
## -------------------------------------------------------------------
'''
def execute(input_str:str) -> str:
    '''
    クリップボードアイテムのコンテンツ文字列を加工するための関数
    Parameters
    ----------
    input_str : str
        クリップボードアイテムのコンテンツ文字列
    Returns
    -------
    str
    加工後の文字列
    '''

    result = input_str
    # ここに処理を記述する


    return result

